<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"gcs","backend":"9238bdafe71d342fb1e8fdf1f620a697898ce1f655ec04a8f69a9e67de8d1f7c","plan_job_ref":"Job Plan Terraform for Warehouse and DAG changes #1029 at https://github.com/cal-itp/data-infra/actions/runs/19484307853","plan_out_hash":"fe3900e372d03ccff52efb7ebb92da3165200e979cd141f93917c529741e0bae","plan_hash":"96656f68cf51cd54658fa92bfb313f8cc03a428d8453ffad7f8a82a5c7a12272","plan_text_format":"diff","version":"1.49.0"} -->
Terraform plan in __iac/cal-itp-data-infra-staging/airflow/us__
<details>
<summary>Plan: 0 to add, 3 to change, 0 to destroy.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
!~  update in-place

Terraform will perform the following actions:

  # google_storage_bucket_object.calitp-staging-composer-catalog will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-staging-composer-catalog" {
!~      content             = (sensitive value)
!~      crc32c              = "sd41+w==" -> (known after apply)
!~      detect_md5hash      = "45G08KszZmaqfMn+DkuoUw==" -> "different hash"
!~      generation          = 1763509068914465 -> (known after apply)
        id                  = "calitp-staging-composer-data/warehouse/target/catalog.json"
!~      md5hash             = "45G08KszZmaqfMn+DkuoUw==" -> (known after apply)
        name                = "data/warehouse/target/catalog.json"
#        (16 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-staging-composer-dags["models/mart/benefits/fct_benefits_events.sql"] will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-staging-composer-dags" {
!~      crc32c              = "AmoX1g==" -> (known after apply)
!~      detect_md5hash      = "32e2YxZ8YVVpaVcbMfrV+w==" -> "different hash"
!~      generation          = 1762380824121196 -> (known after apply)
        id                  = "calitp-staging-composer-data/warehouse/models/mart/benefits/fct_benefits_events.sql"
!~      md5hash             = "32e2YxZ8YVVpaVcbMfrV+w==" -> (known after apply)
        name                = "data/warehouse/models/mart/benefits/fct_benefits_events.sql"
#        (17 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-staging-composer-manifest will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-staging-composer-manifest" {
!~      content             = (sensitive value)
!~      crc32c              = "xzx8+A==" -> (known after apply)
!~      detect_md5hash      = "X4JuwMzDvHDSrVSZyHK+PA==" -> "different hash"
!~      generation          = 1763509070237310 -> (known after apply)
        id                  = "calitp-staging-composer-data/warehouse/target/manifest.json"
!~      md5hash             = "X4JuwMzDvHDSrVSZyHK+PA==" -> (known after apply)
        name                = "data/warehouse/target/manifest.json"
#        (16 unchanged attributes hidden)
    }

Plan: 0 to add, 3 to change, 0 to destroy.
```
</details>

:memo: Plan generated in [Plan Terraform for Warehouse and DAG changes #1029](https://github.com/cal-itp/data-infra/actions/runs/19484307853)